{
  "ext-sslit": {
    "filteredProducts": "The list of SSL/TLS certificates available for order. Run the `plesk ext sslit --product -list` command to get all available certificates and their states.",
    "orderAutoProcessingInterval": "Determines how often the SSL It! extension tries to automatically refresh the state of the placed certificate order.",
    "check-availability-max-attempts": "The maximum number of attempts to check if a domain is accessible via HTTP. The check is required for securing the domains and subdomains that are created with the \"Secure the domain with Let's Encrypt\" option enabled.",
    "check-availability-delay": "The wait time in seconds between attempts to check if a domain is accessible via HTTP. The check is required for securing the domains and subdomains that are created with the \"Secure the domain with Let's Encrypt\" option enabled.",
    "check-availability-timeout": "The timeout in seconds for checking if a domain is accessible via HTTP. If within the time defined by check-availability-timeout, no response code is received, the domain is considered to be unavailable. The check is required for securing the domains and subdomains that are created with the \"Secure the domain with Let's Encrypt\" option enabled.",
    "check-domain-cert-authority": "If set to false, the SSL It! extension will replace only self-signed and expired SSL/TLS certificates. If set to true, the extension will also replace SSL/TLS certificates that are not trusted by any of the root certificates in the trusted CA Root Certificates bundle (see the verify setting). Note: The `check-domain-cert-authority` setting works only if the “Keep websites secured with free SSL certificate” option is enabled.",
    "renew-before-expiration": "The number of days before expiration when the certificate is scheduled for auto-renewal.",
    "send-notifications-interval": "Determines how often the SSL It! extension sends you notifications about the extension-related events (for example, a domain was secured with a certificate, or a certificate was renewed). By default, the extension sends you one email per day informing about events that occurred since the previous email was sent. To receive a separate email notification about each event right after it occurs, set this setting to 0.",
    "dns-challenge-confirmation-interval": "Determines how often the SSL It! extension tries to automatically pass the started DNS challenge (for example, to finish issuing a Let's Encrypt wildcard certificate).",
    "timeout": "The time limit (in seconds) for sending requests to issue an SSL/TLS certificate to the CA server. Helps avoid long wait times if there are issues with the connection or the CA server itself. Accepts the following values: null (default HTTP timeout values), positive integers (we recommend 30 seconds), and 0 (no timeout, not recommended)."
  },
  "ext-letsencrypt": {
    "renew-before-expiration": "The number of days before the certificate renewal.",
    "log-requests": "Logs requests to the ACME server in the Plesk log.",
    "send-notifications-interval": "Determines how often the Let’s Encrypt extension can send you notifications.",
    "key-algorithm": "OpenSSL key type. Can be RSA or ECDSA.",
    "ecdsa-curve-name": "The curve name used in Elliptic curve cryptography (ECC) for public/private key operations. The setting accepts the following values: prime256v1 (NIST P-256) and secp384r1 (NIST P-384).",
    "rsa-key-size": "The size of the RSA private key, in bits.",
    "acme-directory-url": "Directory Resource URI. The default value is https://acme-v02.api.letsencrypt.org/directory",
    "acme-protocol-version": "The ACME version protocol. The current version is acme-v02.",
    "check-domain-cert-authority": "When the “Keep websites secured with free SSL Certificate” option is enabled, if you set this setting to “false”, the Let’s Encrypt extension only replaces self-signed and expired SSL/TLS certificates. If you set it to “true”, the extension also replaces SSL/TLS certificates that are not trusted by any of the root certificates in the trusted CA Root Certificates bundle (see the verify setting).",
    "secure-new-domain": "Sets the default state of the “Secure the domain with Let’s Encrypt” checkbox shown when creating a new subscription, domain, or subdomain.",
    "disable-cleanup": "Disables the cleanup of token files after a domain dispute is resolved.",
    "verify": "The path to the trusted CA Root Certificates bundle.",
    "config-dir": "The path where certificates for third-party integration are stored.",
    "check-availability-delay": "The wait time in seconds between attempts to check if a domain is accessible via HTTP.",
    "check-availability-max-attempts": "The maximum number of attempts to check if a domain is accessible via HTTP.",
    "check-availability-timeout": "The timeout in seconds for checking if a domain is accessible via HTTP. If within the time defined by check-availability-timeout, no response code is received, the domain is considered to be unavailable.",
    "use-common-challenge-dir": "Sets usage of the common challenge directory: /var/www/vhosts/default/.well-known/acme-challenge. Note: The setting is valid in Plesk 12.5 and later for Linux.",
    "letsencrypt-url": "The Let’s Encrypt website URL.",
    "terms-url": "The Let’s Encrypt Policy and Legal Repository URL.",
    "letsencrypt-docs-rate-limits-url": "The URL to Let’s Encrypt documentation about “Rate Limits”. The link is displayed in the extension’s GUI error messages when Let’s Encrypt rate limits have been exceeded.",
    "user-agent": "The User-Agent HTTP header.",
    "fallback-registration-email": "Used as a registration email address when SSL/TLS certificates are renewed. Used only when an email address for domain registration was not saved in ModulesSettings and an email address of a domain owner was not registered."
  },
  "api": {
    "enabled": "Allows or prohibits all connections via Plesk API.",
    "allowedIPs": "Allows connections via Plesk API only from specific IP addresses. Accepts one or more IP addresses separated by commas or whitespace characters.",
    "allowPlainHttpAccess": "Allows or prohibits REST API to accept requests sent via plain HTTP." 
  },
  "aps": {
    "catalogsCustomization": "Allows or prohibits customization of the application catalog.",
    "catalogUrl": "Customizes the URL of the application catalog."
  },
  "databaseManagement": {
    "features.roles.mysql.readWrite": "The default set of privileges for database users with the Read and Write role. Changing the set affects only new database users but not the existing ones. Plesk users can still select privileges that are not listed here unless you also omit these privileges in features.privileges.mysql.dataAccess or features.privileges.mysql.structureAccess.",
    "features.roles.mysql.readOnly": "The default set of privileges for database users with the Read Only role. Changing the set affects only new database users but not the existing ones. Plesk users can still select privileges that are not listed here unless you also omit these privileges in features.privileges.mysql.dataAccess or features.privileges.mysql.structureAccess.",
    "features.roles.mysql.writeOnly": "The default set of privileges for database users with the Write Only role. Changing the set affects only new database users but not the existing ones. Plesk users can still select privileges that are not listed here unless you also omit these privileges in features.privileges.mysql.dataAccess or features.privileges.mysql.structureAccess.",
    "features.privileges.mysql.dataAccess": "The list of Data Access privileges shown in Plesk (Websites & Domains > Databases > User Management) and allowed to be selected. Privileges that are not in this list will not be shown and Plesk users will not be able to select them.",
    "features.privileges.mysql.structureAccess": "The list of Structure Access privileges shown in Plesk (Websites & Domains > Databases > User Management) and allowed to be selected. Privileges that are not in this list will not be shown and Plesk users will not be able to select them.",
    "features.roles.mssql.readWrite": "The list of Microsoft SQL fixed-database roles whose permissions are allowed for the Read and Write role. Changing Microsoft SQL fixed-database roles consequently changes allowed permissions, even though the permissions themselves are not displayed in Plesk (Websites & Domains > Databases > User Management). Changing the list affects only new database users but not the existing ones.",
    "features.roles.mssql.readOnly": "The list of Microsoft SQL fixed-database roles whose permissions are allowed for the Read Only role. Changing Microsoft SQL fixed-database roles consequently changes allowed permissions, even though the permissions themselves are not displayed in Plesk (Websites & Domains > Databases > User Management). Changing the list affects only new database users but not the existing ones.",
    "features.roles.mssql.writeOnly": "The list of Microsoft SQL fixed-database roles whose permissions are allowed for the Write Only role. Changing Microsoft SQL fixed-database roles consequently changes allowed permissions, even though the permissions themselves are not displayed in Plesk (Websites & Domains > Databases > User Management). Changing the list affects only new database users but not the existing ones."
  },
  "ext-social-login": {
    "google.enabled": "Disables or enables logging in to Plesk with Google. When disabled, the Google icon is removed from the Plesk login screen.",
    "facebook.enabled": "Disables or enables logging in to Plesk with Facebook. When disabled, the Facebook icon is removed from the Plesk login screen.",
    "github.enabled": "Disables or enables logging in to Plesk with GitHub. When disabled, the GitHub icon is removed from the Plesk login screen."
  },
  "ext-wp-toolkit": {
    "enabled": "Disables or enables WordPress Toolkit."
  },
  "login": {
    "systemAdmin": "Disables or enables logging in to Plesk with the root or administrator credentials."
  },
  "extensions": {
    "buyUrl": "Resell Plesk extensions from your online store by specifying its URL. It will bring customers to your store (instead of Plesk Online Store) after they click the “Buy Now” button and other upsell links in the Extensions Catalog."
  },
  "updates": {
    "systemUpdatesTool": "(Plesk for Linux) Disables or enables system updates.",
    "safeUpdatesManagement": "(Plesk for Linux) Hides and shows the \"Enable safe updates for system packages\" option in Plesk."
  },
  "ext-catalog": {  
    "contextAds": "Hides and shows extensions promos."
  },
  "security": {  
    "sameOriginOnly": "Protects Plesk from clickjacking. When enabled, prevents Plesk pages from opening within iframes on other websites.",
    "trustedRedirectHosts": "Protects Plesk against open redirect. If you have not set up automatic logging in to Plesk, keep the default empty line as a value. If you have set up automatic logging in to Plesk, specify one or more hostnames to allow URL redirection to them via the success_redirect_url and failure_redirect_url parameters."
  },
  "facebook": {  
    "showLikeLink": "Shows or hides the \"Join Us on Facebook\" link, which redirects to the Plesk Facebook group."
  },
  "twitter": {  
    "showFollowLink": "Shows or hides the Twitter Follow button."
  },
  "ext-rest-api": {  
    "cors.enabled": "Allows or forbids REST API cross-origin resource sharing (CORS). Disabled CORS enhances security.",
    "cors.origin": "Allows cross-origin REST API requests (CORS) from the specified domains only.",
    "cors.methods": "Allows cross-origin REST API requests (CORS) with the specified methods only."
  },
  "rating": {  
    "enabled": "Hides or shows the product rating widget. Using the widget, administrators can give feedback on their Plesk user experience.",
    "showAfterDays": "Sets a number of days after which the product rating widget will be displayed. Using the widget, administrators can give feedback on their Plesk user experience."
  },
  "webserver": {  
    "nginxCacheEnabled": "(Plesk for Linux) Enables or disables nginx caching."
  }
}  
  
