{
  "cli" : {
    "ignoreNonexistentOptions": "Ignorer les options inexistantes dans l'interface de ligne de commande"
  },
  "debug" : {
    "enabled": "Activer le mode débogage (ne pas utiliser dans un environnement de production)"
  },
  "ext-sslit" : {
    "filteredProducts": "La liste des certificats SSL/TLS disponibles à la commande. Exécutez la commande `plesk ext sslit --product -list` pour obtenir tous les certificats disponibles et leur état",
    "orderAutoProcessingInterval": "Détermine la fréquence à laquelle l'extension SSL It ! essaie de rafraîchir automatiquement l'état de la commande de certificat passée.",
    "check-availability-max-attempts": "Le nombre maximum de tentatives pour vérifier si un domaine est accessible via HTTP. La vérification est nécessaire pour sécuriser les domaines et sous-domaines créés avec l'option \"Secure the domain with Let's Encrypt\" activée",
    "check-availability-delay": "Le temps d'attente en secondes entre deux tentatives pour vérifier si un domaine est accessible via HTTP. La vérification est nécessaire pour sécuriser les domaines et sous-domaines créés avec l'option \"Secure the domain with Let's Encrypt\" activée",
    "check-availability-timeout": "Le délai en secondes pour vérifier si un domaine est accessible via HTTP. Si, dans le délai défini par le délai de contrôle de disponibilité, aucun code de réponse n'est reçu, le domaine est considéré comme indisponible. La vérification est nécessaire pour sécuriser les domaines et sous-domaines créés avec l'option \"Secure the domain with Let's Encrypt\" activée",
    "check-domain-cert-authority": "Si elle est définie sur false, l'extension SSL It ! remplacera uniquement les certificats SSL/TLS auto-signés et expirés. Si elle est définie sur true, l'extension remplacera également les certificats SSL/TLS qui ne sont reconnus par aucun des certificats racine du lot de certificats racine de l'autorité de certification de confiance (voir le paramètre de vérification). Note : Le paramètre `check-domain-cert-authority' ne fonctionne que si l'option \"Keep websites secure with free SSL certificate\" est activée",
    "renew-before-expiration": "Le nombre de jours avant l'expiration quand le certificat est programmé pour un renouvellement automatique.",
    "send-notifications-interval": "Détermine la fréquence à laquelle l'extension SSL It ! vous envoie des notifications sur les événements liés à l'extension (par exemple, un domaine a été sécurisé avec un certificat ou un certificat a été renouvelé). Par défaut, l'extension vous envoie un e-mail par jour vous informant des événements survenus depuis l'envoi du précédent e-mail. Pour recevoir une notification par e-mail séparée pour chaque événement juste après qu'il se soit produit, définissez ce paramètre sur 0.",
    "dns-challenge-confirmation-intervalle": "Détermine la fréquence à laquelle l'extension SSL It ! tente de passer automatiquement le défi DNS lancé (par exemple, pour terminer l'émission d'un certificat Wildcard Let's Encrypt).",
    "timeout": "La limite de temps (en secondes) pour l'envoi des demandes d'émission d'un certificat SSL/TLS au serveur CA. Permet d'éviter de longs temps d'attente en cas de problème avec la connexion ou le serveur CA lui-même. Accepte les valeurs suivantes : null (valeurs de délai HTTP par défaut), nombres entiers positifs (nous recommandons 30 secondes), et 0 (pas de délai, non recommandé)."
  },
  "ext-letsencrypt": {
    "Key-Algorithm": "Type de clé OpenSSL. Peut être RSA ou ECDSA",
    "ecdsa-curve-name": "Nom de courbe utilisé en cryptographie par courbe elliptique (ECC) pour les opérations à clé publique/privée. Le réglage accepte les valeurs suivantes : prime256v1 (NIST P-256) et secp384r1 (NIST P-384)."
  },
  "facebook": {
    "showLikeLink": "Montrer le lien j'aime"
  },
  "help": {
    "url": "URL de la Documentation"
  },
  "locale": {
    "showKeys": "Afficher les clés locales au lieu de la chaîne localisée (valeurs : off, on, long)" 
  },
  "promos": {
    "enabled": "Désactiver les promotions d'autres produits"
  },
  "rating": {
    "enabled": "Masquer le dialogue de rétroaction avec la question pour évaluer le produit"
  },
}
